/*********************************************************************************************************
* 模块名称：pwm.h
* 
* 摘    要：4路PWM波形控制接口
* 
* 当前版本：1.0.0
* 
* 作    者：ZLGCX(COPYRIGHT 2021 - 2030 ZLGCX. All rights reserved.)
* 
* 完成日期：2021年05月11日 
* 
* 内    容：1、PWM时钟初始化
*			2、PWM控制接口
*			
* 注    意：                                                                 
**********************************************************************************************************
* 取代版本：
* 
* 作    者： 
* 
* 完成日期：
* 
* 修改内容：
* 
* 修改文件：
*********************************************************************************************************/
#if     _MSC_VER > 1000
#pragma once
#endif

#ifndef __PWM_H
#define __PWM_H

#ifdef __cplusplus
extern "C" {
#endif
	
	
/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define PWM_TIME_CLK		RCC_APB1Periph_TIM2				// PWM时钟模块

#define LED_PWM_PORT		GPIOD							// LED灯PWM驱动接口
#define LED_PWM_CLK			RCC_AHBPeriph_GPIOD

#define LED_PWM_PIN1		GPIO_Pin_1
#define LED_PWM_PIN2		GPIO_Pin_2
#define LED_PWM_PIN3		GPIO_Pin_3
#define LED_PWM_PIN4		GPIO_Pin_4

#define PWM_PULSE			1000L							// PWM周期内计数值
#define PWM_FREQ			10000L							// PWM脉冲频率数值

#define PWM_Drive_PD4(val)	TIM_SetCompare1(TIM2, (val))	// 设置PWM输出驱动
#define PWM_Drive_PD3(val)	TIM_SetCompare2(TIM2, (val))
#define PWM_Drive_PD2(val)	TIM_SetCompare3(TIM2, (val))
#define PWM_Drive_PD1(val)	TIM_SetCompare4(TIM2, (val))

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
	
/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void PWM_Initialize(void);																			// PWM时钟及接口初始化

#ifdef  __cplusplus
}
#endif

#endif  /* __PWM_H */
